{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>X\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "batch_input_shape": [null, 16, 32, 3], "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "output_shape": null}, "class_name": "Lambda"}, {"config": {"name": "Conv1", "b_constraint": null, "b_regularizer": null, "nb_row": 5, "activity_regularizer": null, "nb_filter": 32, "W_regularizer": null, "nb_col": 5, "trainable": true, "W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "bias": true, "activation": "elu", "init": "glorot_uniform", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "Conv2", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 16, "W_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "activation": "elu", "init": "glorot_uniform", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "Conv3", "b_constraint": null, "b_regularizer": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 16, "W_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "activation": "elu", "init": "glorot_uniform", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "FC1", "input_dim": 2048, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "output_dim": 1024, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_1", "input_dim": 1024, "activation": "elu", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "output_dim": 512, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "output", "input_dim": 512, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "output_dim": 1, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}